In [2]:
import numpy as np

In [5]:
ls=np.arange(1,10)

In [6]:
ls

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [7]:
ls[7]

8

In [11]:
ls.dtype

dtype('int32')

In [12]:
for item in ls:
    print(item)

1
2
3
4
5
6
7
8
9

In [13]:
len(ls)

9

In [14]:
import pandas as pd

In [15]:
s1=pd.Series([1,4,5,7])

In [16]:
s1

0    1
1    4
2    5
3    7
dtype: int64

In [17]:
series2 = pd.Series([2,3,4],index=["Feb","Mar","Apr"])

In [18]:
series2

Feb    2
Mar    3
Apr    4
dtype: int64

In [19]:
array=np.array([2,3,4,5,6])

In [21]:
array

array([2, 3, 4, 5, 6])

In [22]:
series3=pd.Series(array,index=[2,4,6,8,10])

In [23]:
series3

2     2
4     3
6     4
8     5
10    6
dtype: int32

In [24]:
temperatures_celsius = pd.Series([25, 26, 27, 28, 29, 30, 31], index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])

In [25]:
temperatures_celsius

Mon    25
Tue    26
Wed    27
Thu    28
Fri    29
Sat    30
Sun    31
dtype: int64

In [26]:
temperatures_celsius.head(3)

Mon    25
Tue    26
Wed    27
dtype: int64

In [27]:
temperatures_celsius.tail(3)

Fri    29
Sat    30
Sun    31
dtype: int64

In [28]:
temperatures_celsius.describe()

count     7.000000
mean     28.000000
std       2.160247
min      25.000000
25%      26.500000
50%      28.000000
75%      29.500000
max      31.000000
dtype: float64

In [29]:
temperatures_celsius.isnull()

Mon    False
Tue    False
Wed    False
Thu    False
Fri    False
Sat    False
Sun    False
dtype: bool

In [30]:
temperatures_celsius = pd.Series([25, 26, 27, np.nan, 29, 30, 31], index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])

In [31]:
temperatures_celsius

Mon    25.0
Tue    26.0
Wed    27.0
Thu     NaN
Fri    29.0
Sat    30.0
Sun    31.0
dtype: float64

In [32]:
temperatures_celsius.isnull()

Mon    False
Tue    False
Wed    False
Thu     True
Fri    False
Sat    False
Sun    False
dtype: bool

In [33]:
temperatures_celsius.notnull()

Mon     True
Tue     True
Wed     True
Thu    False
Fri     True
Sat     True
Sun     True
dtype: bool

In [34]:
s = pd.Series([1, 2, 3, 4, 5])

In [35]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
s[0]

1

In [37]:
s[:3]

0    1
1    2
2    3
dtype: int64

In [38]:
temperatures_celsius['Wed':'Fri']

Wed    27.0
Thu     NaN
Fri    29.0
dtype: float64

In [39]:
#array to dataframe
a1=np.array([2,3,4])
a2=np.array([5,6,7])

In [40]:
d1=pd.DataFrame(a1,a2)

In [41]:
d1

   0
5  2
6  3
7  4

In [42]:
df = pd.DataFrame(data)

In [43]:
d2

   0  1  2
0  2  3  4
1  5  6  7

In [44]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

In [45]:
data

{'calories': [420, 380, 390], 'duration': [50, 40, 45]}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

   calories  duration
0       420        50
1       380        40
2       390        45

In [48]:
data = {'Name': ['John', 'Emma', 'Ryan', 'Sophia', 'Liam'],
        'Age': [25, 30, 28, 35, 40],
        'Gender': ['M', 'F', 'M', 'F', 'M'],
        'Salary': [50000, 60000, 55000, 70000, 65000]}

In [49]:
data

{'Name': ['John', 'Emma', 'Ryan', 'Sophia', 'Liam'],
 'Age': [25, 30, 28, 35, 40],
 'Gender': ['M', 'F', 'M', 'F', 'M'],
 'Salary': [50000, 60000, 55000, 70000, 65000]}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

     Name  Age Gender  Salary
0    John   25      M   50000
1    Emma   30      F   60000
2    Ryan   28      M   55000
3  Sophia   35      F   70000
4    Liam   40      M   65000

In [52]:
df.shape

(5, 4)

In [53]:
df.columns

Index(['Name', 'Age', 'Gender', 'Salary'], dtype='object')

In [54]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [55]:
df['Salary'].mean()

60000.0

In [56]:
df.describe()

            Age       Salary
count   5.00000      5.00000
mean   31.60000  60000.00000
std     5.94138   7905.69415
min    25.00000  50000.00000
25%    28.00000  55000.00000
50%    30.00000  60000.00000
75%    35.00000  65000.00000
max    40.00000  70000.00000

In [57]:
age=df['Age']

In [58]:
age

0    25
1    30
2    28
3    35
4    40
Name: Age, dtype: int64

In [59]:
df1=df[['Age','Salary']]

In [60]:
df1

   Age  Salary
0   25   50000
1   30   60000
2   28   55000
3   35   70000
4   40   65000

In [61]:
selected_columns_loc = df.loc[:, ['Name', 'Age']]

In [62]:
selected_columns_loc

     Name  Age
0    John   25
1    Emma   30
2    Ryan   28
3  Sophia   35
4    Liam   40

In [63]:
selected_columns_loc = df.loc[2:3, ['Name', 'Age']]

In [64]:
selected_columns_loc

     Name  Age
2    Ryan   28
3  Sophia   35

In [65]:
selected_rows = df[df['Age'] > 30]

In [66]:
selected_rows

     Name  Age Gender  Salary
3  Sophia   35      F   70000
4    Liam   40      M   65000